app/views/groups/existing.html.erb

       	   	<select name="group_id" class="form-control">
        	<% Group.all.each do |group| %>
---
SELECT "groups".* FROM "groups"