app/controllers/activities_controller.rb

  def create
    @activity = Activity.new
    @activity.user_id = params[:user_id]
    @activity.date = params[:date]
    @activity.steps = params[:steps]
    @activity.miles = params[:miles]
    @activity.calories = params[:calories]

    if @activity.save
---
INSERT INTO "activities" ("calories", "date", "miles", "steps", "user_id") VALUES (?, ?, ?, ?, ?)  [["calories", 1000], ["date", Sun, 13 Feb 0001], ["miles", 20], ["steps", 2245], ["user_id", 12]]

  def destroy
    @activity = Activity.find_by(id: params[:id])
    @activity.destroy
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = 1 LIMIT 1
DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 1]]