app/controllers/challenges_controller.rb

  def show
    @challenge = Challenge.find_by(id: params[:id])
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 0 LIMIT 1

  def create
    @challenge = Challenge.new
    @challenge.name = params[:name]
    @challenge.data_type_id = params[:data_type_id]
    @challenge.value = params[:value]

    if @challenge.save
---
INSERT INTO "challenges" ("data_type_id", "name", "value") VALUES (?, ?, ?)  [["data_type_id", 12], ["name", "Test"], ["value", 12.0]]

  def destroy
    @challenge = Challenge.find_by(id: params[:id])
    @challenge.destroy
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 2 LIMIT 1
DELETE FROM "challenges" WHERE "challenges"."id" = ?  [["id", 2]]