app/controllers/groups_controller.rb

  def show
    @group = Group.find_by(id: params[:id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 0 LIMIT 1

  def create
    @group = Group.new
    @group.name = params[:name]

    if @group.save
---
INSERT INTO "groups" ("name") VALUES (?)  [["name", "Test group"]]

  def edit
    @group = Group.find_by(id: params[:id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 LIMIT 1

  def destroy
    @group = Group.find_by(id: params[:id])
    @group.destroy
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 3 LIMIT 1
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 3]]

  def joinexisting
    @group = GroupUsers.new
    @group.user_id = '1'
    @group.group_id = params[:group_id]

    if @group.save
---
SELECT "groups".* FROM "groups"
INSERT INTO "group_users" ("created_at", "group_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Wed, 20 Nov 2013 02:28:27 UTC +00:00], ["group_id", 1], ["updated_at", Wed, 20 Nov 2013 02:28:27 UTC +00:00], ["user_id", 1]]