app/controllers/users_controller.rb

  def create
    @user = User.new
    @user.first_name = params[:first_name]
    @user.last_name = params[:last_name]
    @user.email = params[:email]
    @user.password = params[:password]
    @user.age = params[:age]
    @user.address = params[:address]
    @user.zip = params[:zip]

    if @user.save
---
INSERT INTO "users" ("address", "age", "email", "first_name", "last_name", "password", "zip") VALUES (?, ?, ?, ?, ?, ?, ?)  [["address", "123 Sesame Street"], ["age", 20], ["email", "bsmith@gmail.com"], ["first_name", "Bob"], ["last_name", "Smith"], ["password", "bob"], ["zip", 111111]]